---
kind: type
id: T:Autodesk.Revit.DB.WorksetVisibility
source: html/f087ac23-9660-1367-9d88-aa83b1adf4c7.htm
---
# Autodesk.Revit.DB.WorksetVisibility

Indicates the visibility settings of a workset in a particular view.

## Syntax (C#)
```csharp
public enum WorksetVisibility
```